### Pandas
#### **Importando Pandas**

In [3]:
import pandas as pd

In [15]:
alquiler = r"alquiler.csv"
data = pd.read_csv(alquiler,encoding="utf-8",sep=";")
data.head(10)
data.tail(10)
data.sample(10)
data.info()
type(data)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25121 entries, 0 to 25120
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Tipo          25121 non-null  object
 1   Colonia       25121 non-null  object
 2   Habitaciones  25121 non-null  int64
 3   Garages       25121 non-null  int64
 4   Suites        25121 non-null  int64
 5   Area          25121 non-null  int64
 6   Valor         25107 non-null  float64
 7   Condominio    22495 non-null  float64
 8   Impuesto      18037 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.7+ MB

pandas.core.frame.DataFrame

### Exploracion Inicial de los datos
#### *conociendo las filas y columnas del DataFrame con shape*

In [16]:
data.shape

(25121, 9)

In [17]:
data.columns

Index(['Tipo', 'Colonia', 'Habitaciones', 'Garages', 'Suites', 'Area', 'Valor',
       'Condominio', 'Impuesto'],
      dtype='object')

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25121 entries, 0 to 25120
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Tipo          25121 non-null  object
 1   Colonia       25121 non-null  object
 2   Habitaciones  25121 non-null  int64
 3   Garages       25121 non-null  int64
 4   Suites        25121 non-null  int64
 5   Area          25121 non-null  int64
 6   Valor         25107 non-null  float64
 7   Condominio    22495 non-null  float64
 8   Impuesto      18037 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.7+ MB

In [23]:
data[["Valor", "Habitaciones"]]

         Valor  Habitaciones
0       5950.0             1
1      24500.0             2
2      18200.0             0
3       2800.0             1
4       2800.0             1
...        ...           ...
25116  49000.0             0
25117   2800.0             0
25118   4900.0             2
25119  10500.0             2
25120  22750.0             0

[25121 rows x 2 columns]